import * as React from "react";
import Svg, { Path } from "react-native-svg";

type Props = {
  stroke?: string;
};

const Yandex = ({ stroke = "#989B9E" }: Props) => {
  return (
    <Svg id="Слой_1" x="0px" y="0px" viewBox="0 0 745 1000">
      <Path
        d="M372.5,0L372.5,0c199.3,0,360.9,161.6,360.9,360.9l0,0c0,199.3-161.6,360.9-360.9,360.9l0,0
	c-199.3,0-360.9-161.6-360.9-360.9l0,0C11.6,161.6,173.2,0,372.5,0z"
      />
      <Path
        d="M422.6,568.4H498v-433H388.3C278,135.3,220,192,220,275.5c0,66.7,31.8,105.9,88.5,146.4l-98.4,146.4h81.6
	l109.6-163.9l-38-25.5c-46.1-31.1-68.5-55.4-68.5-107.8c0-46.1,32.4-77.3,94.1-77.3h33.6L422.6,568.4L422.6,568.4z"
      />
    </Svg>
  );
};

export default Yandex;
